<a href="https://colab.research.google.com/github/kmouleejunhyuk/bigdata_analysist_practical/blob/main/ADP_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import sklearn
import scipy

In [6]:
rawdata = pd.read_csv('/content/drive/MyDrive/big_2021/data/ADP/모의고사 R코드 및 데이터/모의고사 1회/FIFA.csv', encoding = 'cp949')

In [7]:
rawdata.describe()

                  ID           Age  ...          Value          Wage
count   16642.000000  16642.000000  ...   16642.000000  16642.000000
mean   213846.073849     25.225754  ...    2442.530946      9.618375
std     30546.895337      4.716345  ...    5720.773674     22.264145
min        16.000000     16.000000  ...      10.000000      1.000000
25%    199571.250000     21.000000  ...     300.000000      1.000000
50%    221497.500000     25.000000  ...     675.000000      3.000000
75%    236803.000000     29.000000  ...    2000.000000      8.000000
max    246620.000000     45.000000  ...  118500.000000    565.000000

[8 rows x 9 columns]

In [8]:
rawdata.head()

       ID               Name  Age  ... Release_Clause   Value Wage
0  158023           L. Messi   31  ...         226500  110500  565
1   20801  Cristiano Ronaldo   33  ...         127100   77000  405
2  190871          Neymar Jr   26  ...         228100  118500  290
3  193080             De Gea   27  ...         138600   72000  260
4  192985       K. De Bruyne   27  ...         196400  102000  355

[5 rows x 16 columns]

#ORIGINAL

AGE와 OVERALL의 correlation과 pvalue

In [17]:
scipy.stats.pearsonr(rawdata['Age'], rawdata['Overall'])

(0.4649034580646554, 0.0)

In [ ]:
#연관계수 0.46, pvalue 0.0 => 통계적으로 유의

#ADP

height변수의 단위를 cm으로 변환하여 새로운 변수 height_cm을 생성하시오
(height: ft'inch, 1ft = 30cm, 1inch = 2.5cm)

In [13]:
rawdata['Height_cm'] = [int(x.split("'")[0]) * 30 + int(x.split("'")[1]) * 2.5 for x in rawdata['Height']]

In [16]:
rawdata['Height_cm'].head()

0    167.5
1    185.0
2    172.5
3    190.0
4    177.5
Name: Height_cm, dtype: float64

In [ ]:
Fow = ['LS', ST, RS, LW, LF, CF, RF, RW]
Mid = [LAM, CAM, RAM, LM, LCM, CM, RCM, RM]
Def = []
Goal = []

Position_Class변수의 각 범주에 따른 Value(시장가치)의 평균 차이를 비교하는 일원배치 분산분석을 수행하고 결과를 해석하시오. 유의하다면 사후검정을 수행하고 설명하시오